[
  {
    "id": 1,
    "name": "Hiking",
    "description": "I enjoy exploring the beautiful mountains around Isfahan and other parts of Iran. Hiking helps me clear my mind and connect with nature.",
    "image": "damavand.jpg",
    "frequency": "Twice a month",
    "achievements": [
      "Climbed Mount Damavand (5,610m), Iran's highest peak",
      "Completed the Alam-Kuh trail in the Alborz mountain range",
      "Explored numerous hiking trails in the Zagros mountains"
    ]
  },
  {
    "id": 2,
    "name": "Photography",
    "description": "I have a passion for capturing the beauty of materials at both macro and micro scales. I especially enjoy metallographic photography and landscape photography.",
    "image": "damavand.jpg",
    "frequency": "Weekly",
    "achievements": [
      "Won 2nd place in the university's scientific photography contest",
      "Published several microstructure images in research papers",
      "Created a personal portfolio of landscape photographs from across Iran"
    ]
  },
  {
    "id": 3,
    "name": "Playing Santoor",
    "description": "The santoor is a traditional Persian hammered dulcimer that I've been playing for several years. It helps me relax and connect with my cultural heritage.",
    "image": "damavand.jpg",
    "frequency": "Several times a week",
    "achievements": [
      "Performed at the university's cultural festival",
      "Learned over 20 traditional Persian pieces",
      "Teaching basics to two fellow students"
    ]
  },
  {
    "id": 4,
    "name": "Reading Technical Books",
    "description": "I enjoy expanding my knowledge by reading books on materials science, engineering, and related fields. This helps me stay updated with the latest developments in my field.",
    "image": "damavand.jpg",
    "frequency": "Daily",
    "achievements": [
      "Read over 50 technical books in the past three years",
      "Maintain a personal digital library of reference materials",
      "Participate in a monthly book club with fellow engineering students"
    ]
  },
  {
    "id": 5,
    "name": "Cooking Traditional Persian Food",
    "description": "Cooking is both a science and an art for me. I enjoy preparing traditional Persian dishes and experimenting with different ingredients and techniques.",
    "image": "damavand.jpg",
    "frequency": "Weekly",
    "achievements": [
      "Mastered several complex Persian rice dishes (Tahchin, Zereshk Polo)",
      "Organized cooking gatherings for international students to experience Persian cuisine",
      "Developed my own variations of traditional recipes"
    ]
  }
] 